"""alfa = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i',
        'j', 'k', 'l', 'm', 'n', 'o', 'p', 'q', 'r',
        's', 't', 'u', 'v', 'w', 'x', 'y', 'z'] """


#ანბანი
"""alfa = ['ა', 'ბ', 'გ', 'დ', 'ე', 'ვ', 'ზ', 'თ', 'ი',
        'კ', 'ლ', 'მ', 'ნ', 'ო', 'პ', 'ჟ', 'რ', 'ს',
        'ტ','უ', 'ფ', 'ქ', 'ღ', 'ყ', 'შ', 'ჩ', 'ც',
        'ძ', 'წ', 'ჭ', 'ხ', 'ჯ', 'ჰ']"""


while True: # ვქნით ციკლს რათა ყოველ დამთავრებულ ოპერაციისას გაამეორეს დაშიფრის / დეშეიფრაციის კითხვა
    ch = int(input("""\n
[ 1 ] დაშიფვრა
[ 2 ] დეშიფრაცია
[ 3 ] პროგრამიდან გამოსვლა\n
რომელი ოპერაცია გსურთ შეასრულოთ? : """))  # მისი მეშვეობთ ვირჩევთ შესაბამის მნიშვნელობას მითითებული ოპერაციის შესასრულებლად
    if ch == 1: # თუ ზემოთ შეყვანილი ციფრი = 1 მაშინ სრულდება დაშიფრის პროცედურა
        try:
            m = str(input('შეიყვანეთ ტექსტი: '))  # შეგვყავს სიტყვა/ები რომელიც გვინდა დავშიფროთ
            k = str(input('შეიყვანეთ გასაღები: '))  # შეგვყავს გასაღები რომლითაც დაიშიფრება შეყვანილი ტექსტი

            k *= len(m) // len(k) + 1
            c = ''
            for i, j in enumerate(m): # ამ ციკლის მეშვეობით ვაინდექსებთ და ვყოფთ სიმბლოებად სიტყვას
                gg = ord(j) + ord(k[i]) # სიმბლოები გადაგვყასვ უკვე ათობით სისტემაში და ვკრებთ
                c += chr(gg % 33 + 65)
            print(c)
        except ValueError:
            print('შეიყვანეთ სწორად მოცემული ინფორმაცია')
    if ch == 2: #დეშიფრაციის ველი
        try:
            c = str(input('შეიყვანეთ ტექსტი: '))  # შეგვყავს სიტყვა/ები რომელიც გვინდა დავშიფროთ
            k = str(input('შეიყვანეთ გასაღები: '))  # შეგვყავს გასაღები რომლითაც დაიშიფრება შეყვანილი ტექსტი
            d = ''
            for w, o in enumerate(c):
                gg = (ord(j) - ord(k[i]))
                d += chr(gg % 33 + 65)
            print(d)
        except ValueError:
            print('შეიყვანეთ სწორად მოცემული ინფორმაცია')
    if ch == 3:
        exit()